GopalSaraf/Practicals/PSDL/include/proc/pic18f56q43.inc
// Register: CWG1AS0
#define CWG1AS0 CWG1AS0
CWG1AS0                                  equ 03C2h
// bitfield definitions
CWG1AS0_LSAC_POSN                        equ 0002h
CWG1AS0_LSAC_POSITION                    equ 0002h
CWG1AS0_LSAC_SIZE                        equ 0002h
CWG1AS0_LSAC_LENGTH                      equ 0002h
CWG1AS0_LSAC_MASK                        equ 000Ch
CWG1AS0_LSDBD_POSN                       equ 0004h
CWG1AS0_LSDBD_POSITION                   equ 0004h
CWG1AS0_LSDBD_SIZE                       equ 0002h
CWG1AS0_LSDBD_LENGTH                     equ 0002h
CWG1AS0_LSDBD_MASK                       equ 0030h
CWG1AS0_REN_POSN                         equ 0006h
CWG1AS0_REN_POSITION                     equ 0006h
CWG1AS0_REN_SIZE                         equ 0001h
CWG1AS0_REN_LENGTH                       equ 0001h
CWG1AS0_REN_MASK                         equ 0040h
CWG1AS0_SHUTDOWN_POSN                    equ 0007h
CWG1AS0_SHUTDOWN_POSITION                equ 0007h
CWG1AS0_SHUTDOWN_SIZE                    equ 0001h
CWG1AS0_SHUTDOWN_LENGTH                  equ 0001h
CWG1AS0_SHUTDOWN_MASK                    equ 0080h
CWG1AS0_LSAC0_POSN                       equ 0002h
CWG1AS0_LSAC0_POSITION                   equ 0002h
CWG1AS0_LSAC0_SIZE                       equ 0001h
CWG1AS0_LSAC0_LENGTH                     equ 0001h
CWG1AS0_LSAC0_MASK                       equ 0004h
CWG1AS0_LSCA1_POSN                       equ 0003h
CWG1AS0_LSCA1_POSITION                   equ 0003h
CWG1AS0_LSCA1_SIZE                       equ 0001h
CWG1AS0_LSCA1_LENGTH                     equ 0001h
CWG1AS0_LSCA1_MASK                       equ 0008h
CWG1AS0_LSDB0_POSN                       equ 0004h
CWG1AS0_LSDB0_POSITION                   equ 0004h
CWG1AS0_LSDB0_SIZE                       equ 0001h
CWG1AS0_LSDB0_LENGTH                     equ 0001h
CWG1AS0_LSDB0_MASK                       equ 0010h
CWG1AS0_LSDB1_POSN                       equ 0005h
CWG1AS0_LSDB1_POSITION                   equ 0005h
CWG1AS0_LSDB1_SIZE                       equ 0001h
CWG1AS0_LSDB1_LENGTH                     equ 0001h
CWG1AS0_LSDB1_MASK                       equ 0020h
CWG1AS0_CWG1LSAC0_POSN                   equ 0002h
CWG1AS0_CWG1LSAC0_POSITION               equ 0002h
CWG1AS0_CWG1LSAC0_SIZE                   equ 0001h
CWG1AS0_CWG1LSAC0_LENGTH                 equ 0001h
CWG1AS0_CWG1LSAC0_MASK                   equ 0004h
CWG1AS0_CWG1LSAC1_POSN                   equ 0003h
CWG1AS0_CWG1LSAC1_POSITION               equ 0003h
CWG1AS0_CWG1LSAC1_SIZE                   equ 0001h
CWG1AS0_CWG1LSAC1_LENGTH                 equ 0001h
CWG1AS0_CWG1LSAC1_MASK                   equ 0008h
CWG1AS0_CWG1LSDB0_POSN                   equ 0004h
CWG1AS0_CWG1LSDB0_POSITION               equ 0004h
CWG1AS0_CWG1LSDB0_SIZE                   equ 0001h
CWG1AS0_CWG1LSDB0_LENGTH                 equ 0001h
CWG1AS0_CWG1LSDB0_MASK                   equ 0010h
CWG1AS0_CWG1LSDB1_POSN                   equ 0005h
CWG1AS0_CWG1LSDB1_POSITION               equ 0005h
CWG1AS0_CWG1LSDB1_SIZE                   equ 0001h
CWG1AS0_CWG1LSDB1_LENGTH                 equ 0001h
CWG1AS0_CWG1LSDB1_MASK                   equ 0020h
CWG1AS0_CWG1LSAC_POSN                    equ 0002h
CWG1AS0_CWG1LSAC_POSITION                equ 0002h
CWG1AS0_CWG1LSAC_SIZE                    equ 0002h
CWG1AS0_CWG1LSAC_LENGTH                  equ 0002h
CWG1AS0_CWG1LSAC_MASK                    equ 000Ch
CWG1AS0_CWG1LSDB_POSN                    equ 0004h
CWG1AS0_CWG1LSDB_POSITION                equ 0004h
CWG1AS0_CWG1LSDB_SIZE                    equ 0002h
CWG1AS0_CWG1LSDB_LENGTH                  equ 0002h
CWG1AS0_CWG1LSDB_MASK                    equ 0030h
CWG1AS0_LSBD_POSN                        equ 0004h
CWG1AS0_LSBD_POSITION                    equ 0004h
CWG1AS0_LSBD_SIZE                        equ 0002h
CWG1AS0_LSBD_LENGTH                      equ 0002h
CWG1AS0_LSBD_MASK                        equ 0030h
CWG1AS0_LSAC1_POSN                       equ 0003h
CWG1AS0_LSAC1_POSITION                   equ 0003h
CWG1AS0_LSAC1_SIZE                       equ 0001h
CWG1AS0_LSAC1_LENGTH                     equ 0001h
CWG1AS0_LSAC1_MASK                       equ 0008h
CWG1AS0_LSBD0_POSN                       equ 0004h
CWG1AS0_LSBD0_POSITION                   equ 0004h
CWG1AS0_LSBD0_SIZE                       equ 0001h
CWG1AS0_LSBD0_LENGTH                     equ 0001h
CWG1AS0_LSBD0_MASK                       equ 0010h
CWG1AS0_LSBD1_POSN                       equ 0005h
CWG1AS0_LSBD1_POSITION                   equ 0005h
CWG1AS0_LSBD1_SIZE                       equ 0001h
CWG1AS0_LSBD1_LENGTH                     equ 0001h
CWG1AS0_LSBD1_MASK                       equ 0020h
CWG1AS0_CWG1LSBD0_POSN                   equ 0004h
CWG1AS0_CWG1LSBD0_POSITION               equ 0004h
CWG1AS0_CWG1LSBD0_SIZE                   equ 0001h
CWG1AS0_CWG1LSBD0_LENGTH                 equ 0001h
CWG1AS0_CWG1LSBD0_MASK                   equ 0010h
CWG1AS0_CWG1LSBD1_POSN                   equ 0005h
CWG1AS0_CWG1LSBD1_POSITION               equ 0005h
CWG1AS0_CWG1LSBD1_SIZE                   equ 0001h
CWG1AS0_CWG1LSBD1_LENGTH                 equ 0001h
CWG1AS0_CWG1LSBD1_MASK                   equ 0020h
CWG1AS0_CWG1LSBD_POSN                    equ 0004h
CWG1AS0_CWG1LSBD_POSITION                equ 0004h
CWG1AS0_CWG1LSBD_SIZE                    equ 0002h
CWG1AS0_CWG1LSBD_LENGTH                  equ 0002h
CWG1AS0_CWG1LSBD_MASK                    equ 0030h

// Register: CWG1AS1
#define CWG1AS1 CWG1AS1
CWG1AS1                                  equ 03C3h
// bitfield definitions
CWG1AS1_AS0E_POSN                        equ 0000h
CWG1AS1_AS0E_POSITION                    equ 0000h
CWG1AS1_AS0E_SIZE                        equ 0001h
CWG1AS1_AS0E_LENGTH                      equ 0001h
CWG1AS1_AS0E_MASK                        equ 0001h
CWG1AS1_AS1E_POSN                        equ 0001h
CWG1AS1_AS1E_POSITION                    equ 0001h
CWG1AS1_AS1E_SIZE                        equ 0001h
CWG1AS1_AS1E_LENGTH                      equ 0001h
CWG1AS1_AS1E_MASK                        equ 0002h
CWG1AS1_AS2E_POSN                        equ 0002h
CWG1AS1_AS2E_POSITION                    equ 0002h
CWG1AS1_AS2E_SIZE                        equ 0001h
CWG1AS1_AS2E_LENGTH                      equ 0001h
CWG1AS1_AS2E_MASK                        equ 0004h
CWG1AS1_AS3E_POSN                        equ 0003h
CWG1AS1_AS3E_POSITION                    equ 0003h
CWG1AS1_AS3E_SIZE                        equ 0001h
CWG1AS1_AS3E_LENGTH                      equ 0001h
CWG1AS1_AS3E_MASK                        equ 0008h
CWG1AS1_AS4E_POSN                        equ 0004h
CWG1AS1_AS4E_POSITION                    equ 0004h
CWG1AS1_AS4E_SIZE                        equ 0001h
CWG1AS1_AS4E_LENGTH                      equ 0001h
CWG1AS1_AS4E_MASK                        equ 0010h
CWG1AS1_AS5E_POSN                        equ 0005h
CWG1AS1_AS5E_POSITION                    equ 0005h
CWG1AS1_AS5E_SIZE                        equ 0001h
CWG1AS1_AS5E_LENGTH                      equ 0001h
CWG1AS1_AS5E_MASK                        equ 0020h
CWG1AS1_AS6E_POSN                        equ 0006h
CWG1AS1_AS6E_POSITION                    equ 0006h
CWG1AS1_AS6E_SIZE                        equ 0001h
CWG1AS1_AS6E_LENGTH                      equ 0001h
CWG1AS1_AS6E_MASK                        equ 0040h
CWG1AS1_AS7E_POSN                        equ 0007h
CWG1AS1_AS7E_POSITION                    equ 0007h
CWG1AS1_AS7E_SIZE                        equ 0001h
CWG1AS1_AS7E_LENGTH                      equ 0001h
CWG1AS1_AS7E_MASK                        equ 0080h

// Register: CWG1STR
#define CWG1STR CWG1STR
CWG1STR                                  equ 03C4h
// bitfield definitions
CWG1STR_STRA_POSN                        equ 0000h
CWG1STR_STRA_POSITION                    equ 0000h
CWG1STR_STRA_SIZE                        equ 0001h
CWG1STR_STRA_LENGTH                      equ 0001h
CWG1STR_STRA_MASK                        equ 0001h
CWG1STR_STRB_POSN                        equ 0001h
CWG1STR_STRB_POSITION                    equ 0001h
CWG1STR_STRB_SIZE                        equ 0001h
CWG1STR_STRB_LENGTH                      equ 0001h
CWG1STR_STRB_MASK                        equ 0002h
CWG1STR_STRC_POSN                        equ 0002h
CWG1STR_STRC_POSITION                    equ 0002h
CWG1STR_STRC_SIZE                        equ 0001h
CWG1STR_STRC_LENGTH                      equ 0001h
CWG1STR_STRC_MASK                        equ 0004h
CWG1STR_STRD_POSN                        equ 0003h
CWG1STR_STRD_POSITION                    equ 0003h
CWG1STR_STRD_SIZE                        equ 0001h
CWG1STR_STRD_LENGTH                      equ 0001h
CWG1STR_STRD_MASK                        equ 0008h
CWG1STR_OVRA_POSN                        equ 0004h
CWG1STR_OVRA_POSITION                    equ 0004h
CWG1STR_OVRA_SIZE                        equ 0001h
CWG1STR_OVRA_LENGTH                      equ 0001h
CWG1STR_OVRA_MASK                        equ 0010h
CWG1STR_OVRB_POSN                        equ 0005h
CWG1STR_OVRB_POSITION                    equ 0005h
CWG1STR_OVRB_SIZE                        equ 0001h
CWG1STR_OVRB_LENGTH                      equ 0001h
CWG1STR_OVRB_MASK                        equ 0020h
CWG1STR_OVRC_POSN                        equ 0006h
CWG1STR_OVRC_POSITION                    equ 0006h
CWG1STR_OVRC_SIZE                        equ 0001h
CWG1STR_OVRC_LENGTH                      equ 0001h
CWG1STR_OVRC_MASK                        equ 0040h
CWG1STR_OVRD_POSN                        equ 0007h
CWG1STR_OVRD_POSITION                    equ 0007h
CWG1STR_OVRD_SIZE                        equ 0001h
CWG1STR_OVRD_LENGTH                      equ 0001h
CWG1STR_OVRD_MASK                        equ 0080h
CWG1STR_CWG1STRA_POSN                    equ 0000h
CWG1STR_CWG1STRA_POSITION                equ 0000h
CWG1STR_CWG1STRA_SIZE                    equ 0001h
CWG1STR_CWG1STRA_LENGTH                  equ 0001h
CWG1STR_CWG1STRA_MASK                    equ 0001h
CWG1STR_CWG1STRB_POSN                    equ 0001h
CWG1STR_CWG1STRB_POSITION                equ 0001h
CWG1STR_CWG1STRB_SIZE                    equ 0001h
CWG1STR_CWG1STRB_LENGTH                  equ 0001h
CWG1STR_CWG1STRB_MASK                    equ 0002h
CWG1STR_CWG1STRC_POSN                    equ 0002h
CWG1STR_CWG1STRC_POSITION                equ 0002h
CWG1STR_CWG1STRC_SIZE                    equ 0001h
CWG1STR_CWG1STRC_LENGTH                  equ 0001h
CWG1STR_CWG1STRC_MASK                    equ 0004h
CWG1STR_CWG1STRD_POSN                    equ 0003h
CWG1STR_CWG1STRD_POSITION                equ 0003h
CWG1STR_CWG1STRD_SIZE                    equ 0001h
CWG1STR_CWG1STRD_LENGTH                  equ 0001h
CWG1STR_CWG1STRD_MASK                    equ 0008h
CWG1STR_CWG1OVRA_POSN                    equ 0004h
CWG1STR_CWG1OVRA_POSITION                equ 0004h
CWG1STR_CWG1OVRA_SIZE                    equ 0001h
CWG1STR_CWG1OVRA_LENGTH                  equ 0001h
CWG1STR_CWG1OVRA_MASK                    equ 0010h
CWG1STR_CWG1OVRB_POSN                    equ 0005h
CWG1STR_CWG1OVRB_POSITION                equ 0005h
CWG1STR_CWG1OVRB_SIZE                    equ 0001h
CWG1STR_CWG1OVRB_LENGTH                  equ 0001h
CWG1STR_CWG1OVRB_MASK                    equ 0020h
CWG1STR_CWG1OVRC_POSN                    equ 0006h
CWG1STR_CWG1OVRC_POSITION                equ 0006h
CWG1STR_CWG1OVRC_SIZE                    equ 0001h
CWG1STR_CWG1OVRC_LENGTH                  equ 0001h
CWG1STR_CWG1OVRC_MASK                    equ 0040h
CWG1STR_CWG1OVRD_POSN                    equ 0007h
CWG1STR_CWG1OVRD_POSITION                equ 0007h
CWG1STR_CWG1OVRD_SIZE                    equ 0001h
CWG1STR_CWG1OVRD_LENGTH                  equ 0001h
CWG1STR_CWG1OVRD_MASK                    equ 0080h

// Register: CWG2CLK
#define CWG2CLK CWG2CLK
CWG2CLK                                  equ 03C5h
// bitfield definitions
CWG2CLK_CS_POSN                          equ 0000h
CWG2CLK_CS_POSITION                      equ 0000h
CWG2CLK_CS_SIZE                          equ 0001h
CWG2CLK_CS_LENGTH                        equ 0001h
CWG2CLK_CS_MASK                          equ 0001h
CWG2CLK_CWG2CS_POSN                      equ 0000h
CWG2CLK_CWG2CS_POSITION                  equ 0000h
CWG2CLK_CWG2CS_SIZE                      equ 0001h
CWG2CLK_CWG2CS_LENGTH                    equ 0001h
CWG2CLK_CWG2CS_MASK                      equ 0001h

// Register: CWG2ISM
#define CWG2ISM CWG2ISM
CWG2ISM                                  equ 03C6h
// bitfield definitions
CWG2ISM_ISM_POSN                         equ 0000h
CWG2ISM_ISM_POSITION                     equ 0000h
CWG2ISM_ISM_SIZE                         equ 0008h
CWG2ISM_ISM_LENGTH                       equ 0008h
CWG2ISM_ISM_MASK                         equ 00FFh
CWG2ISM_CWG2ISM_POSN                     equ 0000h
CWG2ISM_CWG2ISM_POSITION                 equ 0000h
CWG2ISM_CWG2ISM_SIZE                     equ 0008h
CWG2ISM_CWG2ISM_LENGTH                   equ 0008h
CWG2ISM_CWG2ISM_MASK                     equ 00FFh
CWG2ISM_ISM0_POSN                        equ 0000h
CWG2ISM_ISM0_POSITION                    equ 0000h
CWG2ISM_ISM0_SIZE                        equ 0001h
CWG2ISM_ISM0_LENGTH                      equ 0001h
CWG2ISM_ISM0_MASK                        equ 0001h
CWG2ISM_ISM1_POSN                        equ 0001h
CWG2ISM_ISM1_POSITION                    equ 0001h
CWG2ISM_ISM1_SIZE                        equ 0001h
CWG2ISM_ISM1_LENGTH                      equ 0001h
CWG2ISM_ISM1_MASK                        equ 0002h
CWG2ISM_ISM2_POSN                        equ 0002h
CWG2ISM_ISM2_POSITION                    equ 0002h
CWG2ISM_ISM2_SIZE                        equ 0001h
CWG2ISM_ISM2_LENGTH                      equ 0001h
CWG2ISM_ISM2_MASK                        equ 0004h
CWG2ISM_ISM3_POSN                        equ 0003h
CWG2ISM_ISM3_POSITION                    equ 0003h
CWG2ISM_ISM3_SIZE                        equ 0001h
CWG2ISM_ISM3_LENGTH                      equ 0001h
CWG2ISM_ISM3_MASK                        equ 0008h
CWG2ISM_ISM4_POSN                        equ 0004h
CWG2ISM_ISM4_POSITION                    equ 0004h
CWG2ISM_ISM4_SIZE                        equ 0001h
CWG2ISM_ISM4_LENGTH                      equ 0001h
CWG2ISM_ISM4_MASK                        equ 0010h

// Register: CWG2DBR
#define CWG2DBR CWG2DBR
CWG2DBR                                  equ 03C7h
// bitfield definitions
CWG2DBR_DBR_POSN                         equ 0000h
CWG2DBR_DBR_POSITION                     equ 0000h
CWG2DBR_DBR_SIZE                         equ 0008h
CWG2DBR_DBR_LENGTH                       equ 0008h
CWG2DBR_DBR_MASK                         equ 00FFh
CWG2DBR_DBR0_POSN                        equ 0000h
CWG2DBR_DBR0_POSITION                    equ 0000h
CWG2DBR_DBR0_SIZE                        equ 0001h
CWG2DBR_DBR0_LENGTH                      equ 0001h
CWG2DBR_DBR0_MASK                        equ 0001h
CWG2DBR_DBR1_POSN                        equ 0001h
CWG2DBR_DBR1_POSITION                    equ 0001h
CWG2DBR_DBR1_SIZE                        equ 0001h
CWG2DBR_DBR1_LENGTH                      equ 0001h
CWG2DBR_DBR1_MASK                        equ 0002h
CWG2DBR_DBR2_POSN                        equ 0002h
CWG2DBR_DBR2_POSITION                    equ 0002h
CWG2DBR_DBR2_SIZE                        equ 0001h
CWG2DBR_DBR2_LENGTH                      equ 0001h
CWG2DBR_DBR2_MASK                        equ 0004h
CWG2DBR_DBR3_POSN                        equ 0003h
CWG2DBR_DBR3_POSITION                    equ 0003h
CWG2DBR_DBR3_SIZE                        equ 0001h
CWG2DBR_DBR3_LENGTH                      equ 0001h
CWG2DBR_DBR3_MASK                        equ 0008h
CWG2DBR_DBR4_POSN                        equ 0004h
CWG2DBR_DBR4_POSITION                    equ 0004h
CWG2DBR_DBR4_SIZE                        equ 0001h
CWG2DBR_DBR4_LENGTH                      equ 0001h
CWG2DBR_DBR4_MASK                        equ 0010h
CWG2DBR_DBR5_POSN                        equ 0005h
CWG2DBR_DBR5_POSITION                    equ 0005h
CWG2DBR_DBR5_SIZE                        equ 0001h
CWG2DBR_DBR5_LENGTH                      equ 0001h
CWG2DBR_DBR5_MASK                        equ 0020h
CWG2DBR_CWG2DBR_POSN                     equ 0000h
CWG2DBR_CWG2DBR_POSITION                 equ 0000h
CWG2DBR_CWG2DBR_SIZE                     equ 0008h
CWG2DBR_CWG2DBR_LENGTH                   equ 0008h
CWG2DBR_CWG2DBR_MASK                     equ 00FFh
CWG2DBR_CWG2DBR0_POSN                    equ 0000h
CWG2DBR_CWG2DBR0_POSITION                equ 0000h
CWG2DBR_CWG2DBR0_SIZE                    equ 0001h
CWG2DBR_CWG2DBR0_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR0_MASK                    equ 0001h
CWG2DBR_CWG2DBR1_POSN                    equ 0001h
CWG2DBR_CWG2DBR1_POSITION                equ 0001h
CWG2DBR_CWG2DBR1_SIZE                    equ 0001h
CWG2DBR_CWG2DBR1_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR1_MASK                    equ 0002h
CWG2DBR_CWG2DBR2_POSN                    equ 0002h
CWG2DBR_CWG2DBR2_POSITION                equ 0002h
CWG2DBR_CWG2DBR2_SIZE                    equ 0001h
CWG2DBR_CWG2DBR2_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR2_MASK                    equ 0004h
CWG2DBR_CWG2DBR3_POSN                    equ 0003h
CWG2DBR_CWG2DBR3_POSITION                equ 0003h
CWG2DBR_CWG2DBR3_SIZE                    equ 0001h
CWG2DBR_CWG2DBR3_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR3_MASK                    equ 0008h
CWG2DBR_CWG2DBR4_POSN                    equ 0004h
CWG2DBR_CWG2DBR4_POSITION                equ 0004h
CWG2DBR_CWG2DBR4_SIZE                    equ 0001h
CWG2DBR_CWG2DBR4_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR4_MASK                    equ 0010h
CWG2DBR_CWG2DBR5_POSN                    equ 0005h
CWG2DBR_CWG2DBR5_POSITION                equ 0005h
CWG2DBR_CWG2DBR5_SIZE                    equ 0001h
CWG2DBR_CWG2DBR5_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR5_MASK                    equ 0020h

