GopalSaraf/Practicals/PSDL/include/proc/pic18f56q43.inc
#define T3CS3                            BANKMASK(T3CLK), 3, b
#define T3CS4                            BANKMASK(T3CLK), 4, b
#define T3GE                             BANKMASK(T3GCON), 7, b
#define T3GGO                            BANKMASK(T3GCON), 3, b
#define T3GPOL                           BANKMASK(T3GCON), 6, b
#define T3GPPS0                          BANKMASK(T3GPPS), 0, b
#define T3GPPS1                          BANKMASK(T3GPPS), 1, b
#define T3GPPS2                          BANKMASK(T3GPPS), 2, b
#define T3GPPS3                          BANKMASK(T3GPPS), 3, b
#define T3GPPS4                          BANKMASK(T3GPPS), 4, b
#define T3GSPM                           BANKMASK(T3GCON), 4, b
#define T3GSS0                           BANKMASK(T3GATE), 0, b
#define T3GSS1                           BANKMASK(T3GATE), 1, b
#define T3GSS2                           BANKMASK(T3GATE), 2, b
#define T3GSS3                           BANKMASK(T3GATE), 3, b
#define T3GSS4                           BANKMASK(T3GATE), 4, b
#define T3GSS5                           BANKMASK(T3GATE), 5, b
#define T3GTM                            BANKMASK(T3GCON), 5, b
#define T3GVAL                           BANKMASK(T3GCON), 2, b
#define T3RD16                           BANKMASK(T3CON), 1, b
#define T4CKPOL                          BANKMASK(T4HLT), 6, b
#define T4CKPS0                          BANKMASK(T4CON), 4, b
#define T4CKPS1                          BANKMASK(T4CON), 5, b
#define T4CKPS2                          BANKMASK(T4CON), 6, b
#define T4CKSYNC                         BANKMASK(T4HLT), 5, b
#define T4CS0                            BANKMASK(T4CLKCON), 0, b
#define T4CS1                            BANKMASK(T4CLKCON), 1, b
#define T4CS2                            BANKMASK(T4CLKCON), 2, b
#define T4CS3                            BANKMASK(T4CLKCON), 3, b
#define T4CS4                            BANKMASK(T4CLKCON), 4, b
#define T4CS5                            BANKMASK(T4CLKCON), 5, b
#define T4INPPS0                         BANKMASK(T4INPPS), 0, b
#define T4INPPS1                         BANKMASK(T4INPPS), 1, b
#define T4INPPS2                         BANKMASK(T4INPPS), 2, b
#define T4INPPS3                         BANKMASK(T4INPPS), 3, b
#define T4INPPS4                         BANKMASK(T4INPPS), 4, b
#define T4MODE0                          BANKMASK(T4HLT), 0, b
#define T4MODE1                          BANKMASK(T4HLT), 1, b
#define T4MODE2                          BANKMASK(T4HLT), 2, b
#define T4MODE3                          BANKMASK(T4HLT), 3, b
#define T4MODE4                          BANKMASK(T4HLT), 4, b
#define T4ON                             BANKMASK(T4CON), 7, b
#define T4OUTPS0                         BANKMASK(T4CON), 0, b
#define T4OUTPS1                         BANKMASK(T4CON), 1, b
#define T4OUTPS2                         BANKMASK(T4CON), 2, b
#define T4OUTPS3                         BANKMASK(T4CON), 3, b
#define T4PSYNC                          BANKMASK(T4HLT), 7, b
#define T4RSEL0                          BANKMASK(T4RST), 0, b
#define T4RSEL1                          BANKMASK(T4RST), 1, b
#define T4RSEL2                          BANKMASK(T4RST), 2, b
#define T4RSEL3                          BANKMASK(T4RST), 3, b
#define T4RSEL4                          BANKMASK(T4RST), 4, b
#define T4RSEL5                          BANKMASK(T4RST), 5, b
#define T4RSEL6                          BANKMASK(T4RST), 6, b
#define T5CKIPPS0                        BANKMASK(T5CKIPPS), 0, b
#define T5CKIPPS1                        BANKMASK(T5CKIPPS), 1, b
#define T5CKIPPS2                        BANKMASK(T5CKIPPS), 2, b
#define T5CKIPPS3                        BANKMASK(T5CKIPPS), 3, b
#define T5CKIPPS4                        BANKMASK(T5CKIPPS), 4, b
#define T5CKIPPS5                        BANKMASK(T5CKIPPS), 5, b
#define T5CKPS0                          BANKMASK(T5CON), 4, b
#define T5CKPS1                          BANKMASK(T5CON), 5, b
#define T5CS0                            BANKMASK(T5CLK), 0, b
#define T5CS1                            BANKMASK(T5CLK), 1, b
#define T5CS2                            BANKMASK(T5CLK), 2, b
#define T5CS3                            BANKMASK(T5CLK), 3, b
#define T5CS4                            BANKMASK(T5CLK), 4, b
#define T5GE                             BANKMASK(T5GCON), 7, b
#define T5GGO                            BANKMASK(T5GCON), 3, b
#define T5GPOL                           BANKMASK(T5GCON), 6, b
#define T5GPPS0                          BANKMASK(T5GPPS), 0, b
#define T5GPPS1                          BANKMASK(T5GPPS), 1, b
#define T5GPPS2                          BANKMASK(T5GPPS), 2, b
#define T5GPPS3                          BANKMASK(T5GPPS), 3, b
#define T5GPPS4                          BANKMASK(T5GPPS), 4, b
#define T5GSPM                           BANKMASK(T5GCON), 4, b
#define T5GSS0                           BANKMASK(T5GATE), 0, b
#define T5GSS1                           BANKMASK(T5GATE), 1, b
#define T5GSS2                           BANKMASK(T5GATE), 2, b
#define T5GSS3                           BANKMASK(T5GATE), 3, b
#define T5GSS4                           BANKMASK(T5GATE), 4, b
#define T5GSS5                           BANKMASK(T5GATE), 5, b
#define T5GTM                            BANKMASK(T5GCON), 5, b
#define T5GVAL                           BANKMASK(T5GCON), 2, b
#define T5RD16                           BANKMASK(T5CON), 1, b
#define T6CKPOL                          BANKMASK(T6HLT), 6, b
#define T6CKPS0                          BANKMASK(T6CON), 4, b
#define T6CKPS1                          BANKMASK(T6CON), 5, b
#define T6CKPS2                          BANKMASK(T6CON), 6, b
#define T6CKSYNC                         BANKMASK(T6HLT), 5, b
#define T6CS0                            BANKMASK(T6CLKCON), 0, b
#define T6CS1                            BANKMASK(T6CLKCON), 1, b
#define T6CS2                            BANKMASK(T6CLKCON), 2, b
#define T6CS3                            BANKMASK(T6CLKCON), 3, b
#define T6CS4                            BANKMASK(T6CLKCON), 4, b
#define T6CS5                            BANKMASK(T6CLKCON), 5, b
#define T6INPPS0                         BANKMASK(T6INPPS), 0, b
#define T6INPPS1                         BANKMASK(T6INPPS), 1, b
#define T6INPPS2                         BANKMASK(T6INPPS), 2, b
#define T6INPPS3                         BANKMASK(T6INPPS), 3, b
#define T6INPPS4                         BANKMASK(T6INPPS), 4, b
#define T6MODE0                          BANKMASK(T6HLT), 0, b
#define T6MODE1                          BANKMASK(T6HLT), 1, b
#define T6MODE2                          BANKMASK(T6HLT), 2, b
#define T6MODE3                          BANKMASK(T6HLT), 3, b
#define T6MODE4                          BANKMASK(T6HLT), 4, b
#define T6ON                             BANKMASK(T6CON), 7, b
#define T6OUTPS0                         BANKMASK(T6CON), 0, b
#define T6OUTPS1                         BANKMASK(T6CON), 1, b
#define T6OUTPS2                         BANKMASK(T6CON), 2, b
#define T6OUTPS3                         BANKMASK(T6CON), 3, b
#define T6PSYNC                          BANKMASK(T6HLT), 7, b
#define T6RSEL0                          BANKMASK(T6RST), 0, b
#define T6RSEL1                          BANKMASK(T6RST), 1, b
#define T6RSEL2                          BANKMASK(T6RST), 2, b
#define T6RSEL3                          BANKMASK(T6RST), 3, b
#define T6RSEL4                          BANKMASK(T6RST), 4, b
#define T6RSEL5                          BANKMASK(T6RST), 5, b
#define T6RSEL6                          BANKMASK(T6RST), 6, b
#define TMD0                             BANKMASK(ADCON3), 0, b
#define TMD1                             BANKMASK(ADCON3), 1, b
#define TMD2                             BANKMASK(ADCON3), 2, b
#define TMR0H0                           BANKMASK(TMR0H), 0, b
#define TMR0H1                           BANKMASK(TMR0H), 1, b
#define TMR0H2                           BANKMASK(TMR0H), 2, b
#define TMR0H3                           BANKMASK(TMR0H), 3, b
#define TMR0H4                           BANKMASK(TMR0H), 4, b
#define TMR0H5                           BANKMASK(TMR0H), 5, b
#define TMR0H6                           BANKMASK(TMR0H), 6, b
#define TMR0H7                           BANKMASK(TMR0H), 7, b
#define TMR0IE                           BANKMASK(PIE3), 7, a
#define TMR0IF                           BANKMASK(PIR3), 7, a
#define TMR0IP                           BANKMASK(IPR3), 7, b
#define TMR0L0                           BANKMASK(TMR0L), 0, b
#define TMR0L1                           BANKMASK(TMR0L), 1, b
#define TMR0L2                           BANKMASK(TMR0L), 2, b
#define TMR0L3                           BANKMASK(TMR0L), 3, b
#define TMR0L4                           BANKMASK(TMR0L), 4, b
#define TMR0L5                           BANKMASK(TMR0L), 5, b
#define TMR0L6                           BANKMASK(TMR0L), 6, b
#define TMR0L7                           BANKMASK(TMR0L), 7, b
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR1GIE                          BANKMASK(PIE3), 5, a
#define TMR1GIF                          BANKMASK(PIR3), 5, a
#define TMR1GIP                          BANKMASK(IPR3), 5, b
#define TMR1H0                           BANKMASK(TMR1H), 0, b
#define TMR1H1                           BANKMASK(TMR1H), 1, b
#define TMR1H2                           BANKMASK(TMR1H), 2, b
#define TMR1H3                           BANKMASK(TMR1H), 3, b
#define TMR1H4                           BANKMASK(TMR1H), 4, b
#define TMR1H5                           BANKMASK(TMR1H), 5, b
#define TMR1H6                           BANKMASK(TMR1H), 6, b
#define TMR1H7                           BANKMASK(TMR1H), 7, b
#define TMR1IE                           BANKMASK(PIE3), 4, a
#define TMR1IF                           BANKMASK(PIR3), 4, a
#define TMR1IP                           BANKMASK(IPR3), 4, b
#define TMR1L0                           BANKMASK(TMR1L), 0, b
#define TMR1L1                           BANKMASK(TMR1L), 1, b
#define TMR1L2                           BANKMASK(TMR1L), 2, b
#define TMR1L3                           BANKMASK(TMR1L), 3, b
#define TMR1L4                           BANKMASK(TMR1L), 4, b
#define TMR1L5                           BANKMASK(TMR1L), 5, b
#define TMR1L6                           BANKMASK(TMR1L), 6, b
#define TMR1L7                           BANKMASK(TMR1L), 7, b
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, b
#define TMR2IE                           BANKMASK(PIE3), 3, a
#define TMR2IF                           BANKMASK(PIR3), 3, a
#define TMR2IP                           BANKMASK(IPR3), 3, b
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 7, b
#define TMR3GIE                          BANKMASK(PIE5), 5, a
#define TMR3GIF                          BANKMASK(PIR5), 5, a
#define TMR3GIP                          BANKMASK(IPR5), 5, b
#define TMR3H0                           BANKMASK(TMR3H), 0, b
#define TMR3H1                           BANKMASK(TMR3H), 1, b
#define TMR3H2                           BANKMASK(TMR3H), 2, b
#define TMR3H3                           BANKMASK(TMR3H), 3, b
#define TMR3H4                           BANKMASK(TMR3H), 4, b
#define TMR3H5                           BANKMASK(TMR3H), 5, b
#define TMR3H6                           BANKMASK(TMR3H), 6, b
#define TMR3H7                           BANKMASK(TMR3H), 7, b
#define TMR3IE                           BANKMASK(PIE5), 4, a
#define TMR3IF                           BANKMASK(PIR5), 4, a
#define TMR3IP                           BANKMASK(IPR5), 4, b
#define TMR3L0                           BANKMASK(TMR3L), 0, b
#define TMR3L1                           BANKMASK(TMR3L), 1, b
#define TMR3L2                           BANKMASK(TMR3L), 2, b
#define TMR3L3                           BANKMASK(TMR3L), 3, b
#define TMR3L4                           BANKMASK(TMR3L), 4, b
#define TMR3L5                           BANKMASK(TMR3L), 5, b
#define TMR3L6                           BANKMASK(TMR3L), 6, b
#define TMR3L7                           BANKMASK(TMR3L), 7, b
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, b
#define TMR4IE                           BANKMASK(PIE11), 3, a
#define TMR4IF                           BANKMASK(PIR11), 3, a
#define TMR4IP                           BANKMASK(IPR11), 3, b
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 7, b
#define TMR5GIE                          BANKMASK(PIE8), 5, a
#define TMR5GIF                          BANKMASK(PIR8), 5, a
#define TMR5GIP                          BANKMASK(IPR8), 5, b
#define TMR5H0                           BANKMASK(TMR5H), 0, b
#define TMR5H1                           BANKMASK(TMR5H), 1, b
#define TMR5H2                           BANKMASK(TMR5H), 2, b
#define TMR5H3                           BANKMASK(TMR5H), 3, b
#define TMR5H4                           BANKMASK(TMR5H), 4, b
#define TMR5H5                           BANKMASK(TMR5H), 5, b
#define TMR5H6                           BANKMASK(TMR5H), 6, b
#define TMR5H7                           BANKMASK(TMR5H), 7, b
#define TMR5IE                           BANKMASK(PIE8), 4, a
#define TMR5IF                           BANKMASK(PIR8), 4, a
#define TMR5IP                           BANKMASK(IPR8), 4, b
#define TMR5L0                           BANKMASK(TMR5L), 0, b
#define TMR5L1                           BANKMASK(TMR5L), 1, b
#define TMR5L2                           BANKMASK(TMR5L), 2, b
#define TMR5L3                           BANKMASK(TMR5L), 3, b
#define TMR5L4                           BANKMASK(TMR5L), 4, b
#define TMR5L5                           BANKMASK(TMR5L), 5, b
#define TMR5L6                           BANKMASK(TMR5L), 6, b
#define TMR5L7                           BANKMASK(TMR5L), 7, b
#define TMR5MD                           BANKMASK(PMD1), 5, b
#define TMR5ON                           BANKMASK(T5CON), 0, b
#define TMR6IE                           BANKMASK(PIE15), 3, a
#define TMR6IF                           BANKMASK(PIR15), 3, a
#define TMR6IP                           BANKMASK(IPR15), 3, b
#define TMR6MD                           BANKMASK(PMD1), 6, b
#define TMR6ON                           BANKMASK(T6CON), 7, b
#define TRIGEN                           BANKMASK(SCANCON0), 6, b
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISD0                           BANKMASK(TRISD), 0, a
#define TRISD1                           BANKMASK(TRISD), 1, a
#define TRISD2                           BANKMASK(TRISD), 2, a
#define TRISD3                           BANKMASK(TRISD), 3, a
#define TRISD4                           BANKMASK(TRISD), 4, a
#define TRISD5                           BANKMASK(TRISD), 5, a
#define TRISD6                           BANKMASK(TRISD), 6, a
#define TRISD7                           BANKMASK(TRISD), 7, a
#define TRISE0                           BANKMASK(TRISE), 0, a
#define TRISE1                           BANKMASK(TRISE), 1, a
#define TRISE2                           BANKMASK(TRISE), 2, a
#define TRISF0                           BANKMASK(TRISF), 0, a
#define TRISF1                           BANKMASK(TRISF), 1, a
#define TRISF2                           BANKMASK(TRISF), 2, a
#define TRISF3                           BANKMASK(TRISF), 3, a
#define TRISF4                           BANKMASK(TRISF), 4, a
#define TRISF5                           BANKMASK(TRISF), 5, a
#define TRISF6                           BANKMASK(TRISF), 6, a
#define TRISF7                           BANKMASK(TRISF), 7, a
#define TS                               BANKMASK(SMT1STAT), 2, b
#define TSEL0                            BANKMASK(SCANTRIG), 0, b
#define TSEL1                            BANKMASK(SCANTRIG), 1, b
#define TSEL2                            BANKMASK(SCANTRIG), 2, b
#define TSEL3                            BANKMASK(SCANTRIG), 3, b
#define TSEL4                            BANKMASK(SCANTRIG), 4, b
#define TSEN                             BANKMASK(FVRCON), 5, b
#define TSRNG                            BANKMASK(FVRCON), 4, b
#define TUN0                             BANKMASK(OSCTUNE), 0, b
#define TUN1                             BANKMASK(OSCTUNE), 1, b
#define TUN2                             BANKMASK(OSCTUNE), 2, b
#define TUN3                             BANKMASK(OSCTUNE), 3, b
#define TUN4                             BANKMASK(OSCTUNE), 4, b
#define TUN5                             BANKMASK(OSCTUNE), 5, b
#define TXU                              BANKMASK(I2C1CON1), 1, b
#define U1ABDEN                          BANKMASK(U1CON0), 6, b
#define U1ABDIE                          BANKMASK(U1UIR), 2, b
#define U1ABDIF                          BANKMASK(U1UIR), 6, b
#define U1ABDOVE                         BANKMASK(U1ERRIE), 5, b
#define U1ABDOVF                         BANKMASK(U1ERRIR), 5, b
#define U1BRGS                           BANKMASK(U1CON0), 7, b
#define U1BRKOVR                         BANKMASK(U1CON1), 1, b
#define U1C0EN                           BANKMASK(U1CON2), 3, b
#define U1CERIE                          BANKMASK(U1ERRIE), 4, b
#define U1CERIF                          BANKMASK(U1ERRIR), 4, b
#define U1CTSPPS0                        BANKMASK(U1CTSPPS), 0, b
#define U1CTSPPS1                        BANKMASK(U1CTSPPS), 1, b
#define U1CTSPPS2                        BANKMASK(U1CTSPPS), 2, b
#define U1CTSPPS3                        BANKMASK(U1CTSPPS), 3, b
#define U1CTSPPS4                        BANKMASK(U1CTSPPS), 4, b
#define U1CTSPPS5                        BANKMASK(U1CTSPPS), 5, b
#define U1EIE                            BANKMASK(PIE4), 2, a
#define U1EIF                            BANKMASK(PIR4), 2, a
#define U1EIP                            BANKMASK(IPR4), 2, b
#define U1FERIE                          BANKMASK(U1ERRIE), 3, b
#define U1FERIF                          BANKMASK(U1ERRIR), 3, b
#define U1FLO0                           BANKMASK(U1CON2), 0, b
#define U1FLO1                           BANKMASK(U1CON2), 1, b
#define U1IE                             BANKMASK(PIE4), 3, a
#define U1IF                             BANKMASK(PIR4), 3, a
#define U1IP                             BANKMASK(IPR4), 3, b
#define U1MD                             BANKMASK(PMD6), 3, b
#define U1MODE0                          BANKMASK(U1CON0), 0, b
#define U1MODE1                          BANKMASK(U1CON0), 1, b
#define U1MODE2                          BANKMASK(U1CON0), 2, b
#define U1MODE3                          BANKMASK(U1CON0), 3, b
#define U1ON                             BANKMASK(U1CON1), 7, b
#define U1PERIE                          BANKMASK(U1ERRIE), 6, b
#define U1PERIF                          BANKMASK(U1ERRIR), 6, b
#define U1RCIDL                          BANKMASK(U1FIFO), 3, b
#define U1RUNOVF                         BANKMASK(U1CON2), 7, b
#define U1RXBE                           BANKMASK(U1FIFO), 1, b
#define U1RXBF                           BANKMASK(U1FIFO), 0, b
#define U1RXBIMD                         BANKMASK(U1CON1), 3, b
#define U1RXBKIE                         BANKMASK(U1ERRIE), 2, b
#define U1RXBKIF                         BANKMASK(U1ERRIR), 2, b
#define U1RXEN                           BANKMASK(U1CON0), 4, b
#define U1RXFOIE                         BANKMASK(U1ERRIE), 1, b
#define U1RXFOIF                         BANKMASK(U1ERRIR), 1, b
#define U1RXIDL                          BANKMASK(U1FIFO), 3, b
#define U1RXIE                           BANKMASK(PIE4), 0, a
#define U1RXIF                           BANKMASK(PIR4), 0, a
#define U1RXIP                           BANKMASK(IPR4), 0, b
#define U1RXPOL                          BANKMASK(U1CON2), 6, b
#define U1RXPPS0                         BANKMASK(U1RXPPS), 0, b
#define U1RXPPS1                         BANKMASK(U1RXPPS), 1, b
#define U1RXPPS2                         BANKMASK(U1RXPPS), 2, b
#define U1RXPPS3                         BANKMASK(U1RXPPS), 3, b
#define U1RXPPS4                         BANKMASK(U1RXPPS), 4, b
#define U1RXPPS5                         BANKMASK(U1RXPPS), 5, b
#define U1SENDB                          BANKMASK(U1CON1), 0, b
#define U1STP0                           BANKMASK(U1CON2), 4, b
#define U1STP1                           BANKMASK(U1CON2), 5, b
#define U1STPMD                          BANKMASK(U1FIFO), 6, b
#define U1TXBE                           BANKMASK(U1FIFO), 5, b
#define U1TXBF                           BANKMASK(U1FIFO), 4, b
#define U1TXCIE                          BANKMASK(U1ERRIE), 0, b
#define U1TXCIF                          BANKMASK(U1ERRIR), 0, b
#define U1TXEN                           BANKMASK(U1CON0), 5, b
#define U1TXIE                           BANKMASK(PIE4), 1, a
#define U1TXIF                           BANKMASK(PIR4), 1, a
#define U1TXIP                           BANKMASK(IPR4), 1, b
#define U1TXMTIE                         BANKMASK(U1ERRIE), 7, b
#define U1TXMTIF                         BANKMASK(U1ERRIR), 7, b
#define U1TXPOL                          BANKMASK(U1CON2), 2, b
#define U1TXWRE                          BANKMASK(U1FIFO), 7, b
#define U1WUE                            BANKMASK(U1CON1), 4, b
#define U1WUIF                           BANKMASK(U1UIR), 7, b
#define U1XON                            BANKMASK(U1FIFO), 2, b
#define U2ABDEN                          BANKMASK(U2CON0), 6, b
#define U2ABDIE                          BANKMASK(U2UIR), 2, b
#define U2ABDIF                          BANKMASK(U2UIR), 6, b
#define U2ABDOVE                         BANKMASK(U2ERRIE), 5, b
#define U2ABDOVF                         BANKMASK(U2ERRIR), 5, b
#define U2BRGS                           BANKMASK(U2CON0), 7, b
#define U2BRKOVR                         BANKMASK(U2CON1), 1, b
#define U2CERIE                          BANKMASK(U2ERRIE), 4, b
#define U2CERIF                          BANKMASK(U2ERRIR), 4, b
#define U2CTSPPS0                        BANKMASK(U2CTSPPS), 0, b
#define U2CTSPPS1                        BANKMASK(U2CTSPPS), 1, b
#define U2CTSPPS2                        BANKMASK(U2CTSPPS), 2, b
#define U2CTSPPS3                        BANKMASK(U2CTSPPS), 3, b
#define U2CTSPPS4                        BANKMASK(U2CTSPPS), 4, b
#define U2EIE                            BANKMASK(PIE8), 2, a
